/* Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, 
длина которых меньше, либо равна 3 символам. */

string[] array = new string [] { "Mama", "12", "Sister", "Bro", "52" };

foreach (string i in array)
{
    Console.Write(i + " ");
}




